# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true
brew 'git'
brew 'bash-completion'
brew 'tree'
#brew 'wget'
brew 'youtube-dl'
# Casks
cask 'appcleaner'
cask 'carbon-copy-cloner'
cask 'knockknock'
cask 'hyper'
cask 'imageoptim'
cask 'gitup'
cask 'caffeine'
cask 'spectacle'
cask 'vlc'
cask 'google-chrome'
cask 'dropbox'
cask 'evernote'
cask 'flux'
#cask 'skype'
cask 'virtualbox'
cask 'sqlitebrowser'
cask 'postico'
cask 'transmission'
cask 'slack'
cask 'kindle'
cask 'keepassxc'
cask 'calibre'
cask 'cocktail'
#cask 'dash'
#cask 'atom'
#cask 'google-drive'
cask 'firefox'
#cask 'licecap'
cask 'macdown' #markdown viewer
#cask 'sublime'
# To convert mov to gif
# https://gist.github.com/dergachev/4627207
cask 'xquartz'
cask 'fluid'
# Quick Look Plugins
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicknfo'
cask 'webpquicklook'
brew 'gifsicle'

# for indigo theme
# https://github.com/sergiokopplin/indigo
# http://bundler.io/

# for react native to run the facebook F8 app
# https://github.com/fbsamples/f8app
#brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
#brew 'flow' # http://www.flowtype.org/
#brew 'mongodb' # https://www.mongodb.org/downloads#production

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
tap 'argon/mas'
brew 'mas'
# run download_apps later on

#go
#brew 'go'

# python
#brew 'python'
#brew 'python3'

#brew 'carthage'

# for my blog, install jekyll and bundler
# https://github.com/sergiokopplin/indigo
#brew 'yarn' # To edit app.css in Jekyll theme duo
#brew cask keybase
#brew mpg123
#brew ffmpeg #to convert mov to mp4